RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_dsp2.c
/**
  ******************************************************************************
  * @file    bl808_dsp2.c
  * @version V1.0
  * @date
  * @brief   This file is the standard driver c file
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

#include "bl808_dsp2.h"

/** @addtogroup  BL808_Peripheral_Driver
 *  @{
 */

/** @addtogroup  DSP2
 *  @{
 */

/** @defgroup  DSP2_Private_Macros
 *  @{
 */
#define DSP2_PRINT_LOG 0
#if DSP2_PRINT_LOG
#include "bflb_platform.h"
#endif

/* To avoid divide-0 exception in code */
#define DIV_0_TO_1(a) ((0 == (a)) ? 1 : (a))

#define DIV_ROUND(divident, divider) (((divident) + ((divider) >> 1)) / (divider))

#define SIGN_EXTEND(x, num_bits) ((((int)(x)) & ((1 << num_bits) - 1)) << (32 - num_bits) >> (32 - num_bits))

#define BL_SET_REG_BITS_VAL_2(val, bitname, bitval) \
    (((val)&bitname##_UMSK) | (((uint32_t)(bitval) << bitname##_POS) & bitname##_MSK))

#define AE_SRAM_BASE  ((uint32_t)0x30019000) /*!< AE status SRAM base address */
#define AWB_SRAM_BASE ((uint32_t)0x3001c000) /*!< AWB status SRAM base address */

#define DSP2_BLC_MAX 1023
#define DSP2_BLC_MIN 0

#define DSP2_BNR_WEIGHT_MAX     64
#define DSP2_BNR_WEIGHT_MIN     0
#define DSP2_BNR_LPF_WEIGHT_MAX 16
#define DSP2_BNR_LPF_WEIGHT_MIN 0

#define DSP2_GAIN_MAX 2047
#define DSP2_GAIN_MIN 0

#define DSP2_CCM_MAX 2047
#define DSP2_CCM_MIN -2048

#define DSP2_BRIGHTNESS_MAX 127
#define DSP2_BRIGHTNESS_MIN -128

#define DSP2_CONTRAST_MAX 255
#define DSP2_CONTRAST_MIN 0

#define DSP2_SATURATION_MAX 255
#define DSP2_SATURATION_MIN 0

#define DSP2_NOISE_LEVEL_MAX 63
#define DSP2_NOISE_LEVEL_MIN 0

#define DSP2_NOISE_THRESHOLD_MAX 127
#define DSP2_NOISE_THRESHOLD_MIN 0

#define DSP2_NR_STRENGTH_MAX 15
#define DSP2_NR_STRENGTH_MIN 0

#define DSP2_Edge_Enhance_LEVEL_MAX 127
#define DSP2_Edge_Enhance_LEVEL_MIN 0

#define DSP2_Edge_Enhance_LIMIT_MAX 255
#define DSP2_Edge_Enhance_LIMIT_MIN 0

#define DSP2_Edge_Enhance_HPF_MAX 8
#define DSP2_Edge_Enhance_HPF_MIN 0

#define DSP2_DPC_TH_MAX 255
#define DSP2_DPC_TH_MIN 0

#define DSP2_AE_ROI_START_X_RANGE_MAX 2047
#define DSP2_AE_ROI_START_Y_RANGE_MAX 2047
#define DSP2_AE_ROI_WIDTH_RANGE_MAX   2047
#define DSP2_AE_ROI_WIDTH_RANGE_MIN   32
#define DSP2_AE_ROI_HEIGHT_RANGE_MAX  2047
#define DSP2_AE_ROI_HEIGHT_RANGE_MIN  2

#define DSP2_AE_GRID_WIDTH_RANGE_MAX  255
#define DSP2_AE_GRID_WIDTH_RANGE_MIN  32
#define DSP2_AE_GRID_HEIGHT_RANGE_MAX 255
#define DSP2_AE_GRID_HEIGHT_RANGE_MIN 2
#define DSP2_AE_GRID_NUM_X_RANGE_MAX  12
#define DSP2_AE_GRID_NUM_X_RANGE_MIN  1
#define DSP2_AE_GRID_NUM_Y_RANGE_MAX  8
#define DSP2_AE_GRID_NUM_Y_RANGE_MIN  1

#define DSP2_AWB_ROI_START_X_RANGE_MAX 2047
#define DSP2_AWB_ROI_START_Y_RANGE_MAX 2047
#define DSP2_AWB_ROI_WIDTH_RANGE_MAX   2047
#define DSP2_AWB_ROI_WIDTH_RANGE_MIN   32
#define DSP2_AWB_ROI_HEIGHT_RANGE_MAX  2047
#define DSP2_AWB_ROI_HEIGHT_RANGE_MIN  2

#define DSP2_AWB_GRID_WIDTH_RANGE_MAX  255
#define DSP2_AWB_GRID_WIDTH_RANGE_MIN  32
#define DSP2_AWB_GRID_HEIGHT_RANGE_MAX 255
#define DSP2_AWB_GRID_HEIGHT_RANGE_MIN 2
#define DSP2_AWB_GRID_NUM_X_RANGE_MAX  32
#define DSP2_AWB_GRID_NUM_X_RANGE_MIN  1
#define DSP2_AWB_GRID_NUM_Y_RANGE_MAX  32
#define DSP2_AWB_GRID_NUM_Y_RANGE_MIN  1

#define DSP2_AWB_R_MAX_THR_RANGE_MAX 4095
#define DSP2_AWB_R_MIN_THR_RANGE_MAX 4095
#define DSP2_AWB_G_MAX_THR_RANGE_MAX 4095
#define DSP2_AWB_G_MIN_THR_RANGE_MAX 4095
#define DSP2_AWB_B_MAX_THR_RANGE_MAX 4095
#define DSP2_AWB_B_MIN_THR_RANGE_MAX 4095

#define DSP2_LSC_OFFSET_MAX 127
#define DSP2_LSC_OFFSET_MIN -128

#define DSP2_EE_DIR_SHPNSS_THRESH_MAX     127
#define DSP2_EE_NO_DIR_SHPNSS_THRESH_MAX  127
#define DSP2_EE_FLAT_REGION_THRESH_MAX    255
#define DSP2_EE_TEXTURE_REGION_THRESH_MAX 511
#define DSP2_EE_EDGE_REGION_THRESH_MAX    65535

#define DSP2_EE_STRENGTH_MAX    127
#define DSP2_EE_NR_STRENGTH_MAX 255

#define DSP2_EE_LUMA_WEIGHT_MAX 1023

#define DSP2_AE_SRAM_BANK1 (AE_SRAM_BASE)         /*!< 0x30019000 */
#define DSP2_AE_SRAM_BANK2 (AE_SRAM_BASE + (768)) /*!< 0x30019300 */

#define DSP2_AWB_SRAM_BANK1 (AWB_SRAM_BASE)              /*!< 0x3001c000 */
#define DSP2_AWB_SRAM_BANK2 (AWB_SRAM_BASE + (1024 * 8)) /*!< 0x3001e000 */

#define DSP2_LSC_MAX_MAX 255
#define DSP2_LSC_MAX_MIN 0

#define DSP2_ERROR_ADDR 0xffffffff

/* For 16bits reg, high 8bits offset 1Byte is low 8bits */
#define DSP2_REG_H_L_OFFSET 0X1

/* Read 16 bits data consits of high 8bits and low 8bits */
#define BL_RD_16_H_L_REG(addr_h, addr_l) \
    ((BL_RD_BYTE(addr_h)) << 8) + (BL_RD_BYTE(addr_l))

#define DSP2_RD_16_H_L_REG(regname_h, regname_l) \
    ((BL_RD_BYTE_REG(DSP2_BASE, regname_h)) << 8) + (BL_RD_BYTE_REG(DSP2_BASE, regname_l))

#define IS_BLACK_WHITE_MODE(mode) (mode == BLACK_WHITE_MODE_ON)

/*@} end of group DSP2_Private_Macros */

