RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_dsp2.c
/** @defgroup  DSP2_Private_Types
 *  @{
 */
typedef enum {
    DSP2_DPC_OFF = 0,
    DSP2_DPC_FLY,
} DSP2_DPC_MODE_TYPE;

typedef enum {
    DSP2_HSYNC_INVERT_NORMAL = 0,
    DSP2_HSYNC_INVERT_INVERT,
} DSP2_HSYNC_INVERT_TYPE;

typedef enum {
    DSP2_VSYNC_INVERT_NORMAL = 0,
    DSP2_VSYNC_INVERT_INVERT,
} DSP2_VSYNC_INVERT_TYPE;

typedef enum {
    DSP2_HCNT_RST_RISING = 0,
    DSP2_HCNT_RST_FALLING,
} DSP2_HCNT_RST_TYPE;

typedef enum {
    DSP2_VCNT_RST_RISING = 0,
    DSP2_VCNT_RST_FALLING,
} DSP2_VCNT_RST_TYPE;

typedef enum {
    DSP2_VCNT_RST_REVERT_FALLING = 0,
    DSP2_VCNT_RST_REVERT_RISING,
} DSP2_VCNT_RST_REVERT_TYPE;

typedef enum {
    DSP2_FHBLK_LINE_OFF = 0,
    DSP2_FHBLK_LINE_ON = 1,
} DSP2_FHBLK_LINE_TYPE;

/*@} end of group DSP2_Private_Types */

/** @defgroup  DSP2_Private_Variables
 *  @{
 */

/*@} end of group DSP2_Private_Variables */

/** @defgroup  DSP2_Global_Variables
 *  @{
 */

/*@} end of group DSP2_Global_Variables */

/** @defgroup  DSP2_Private_Fun_Declaration
 *  @{
 */

/*@} end of group DSP2_Private_Fun_Declaration */

/** @defgroup  DSP2_Private_Functions
 *  @{
 */
static uint16_t DSP2_Calc_Total_Width(const DSP2_TG_Cfg_Type *config)
{
    // uint32_t pix_clk = config->pix_clk;
    // uint32_t DSP2_clk = config->DSP2_clk;
    // uint16_t sns_tot_width = config->total_width;

    return (uint16_t)((uint64_t)config->DSP2_clk / config->total_height / config->fps + 48) & 0xFFFE;

    /* the final total width must be even */

    // return (uint16_t)((uint64_t)DSP2_clk/1125/25) & 0xFFFE;
    // return (uint16_t)((uint64_t)sns_tot_width * DSP2_clk / pix_clk + 48) & 0xFFFE;    //TODO: remove magic number
}

static bool is_LSC_Coeff_Valid(const DSP2_LSC_COEF_S *lsc)
{
    int i;

    const int DSP2_LSC_COEF_LIMIT[LSC_COEF_NUM][2] = {
        { -4194304, 4194303 }, /*!< A */
        { -4096, 4095 },       /*!< B */
        { 0, 255 },            /*!< C */
        { -4194304, 4194303 }, /*!< D */
        { -4096, 4095 },       /*!< E */
        { -4194304, 4194303 }, /*!< G */
    };

    for (i = 0; i < LSC_COEF_NUM; ++i) {
        if ((lsc->lsc_coef_r.coef[i]) < DSP2_LSC_COEF_LIMIT[i][0] || (lsc->lsc_coef_r.coef[i]) > DSP2_LSC_COEF_LIMIT[i][1]) {
            return false;
        }

        if ((lsc->lsc_coef_g.coef[i]) < DSP2_LSC_COEF_LIMIT[i][0] || (lsc->lsc_coef_g.coef[i]) > DSP2_LSC_COEF_LIMIT[i][1]) {
            return false;
        }

        if ((lsc->lsc_coef_b.coef[i]) < DSP2_LSC_COEF_LIMIT[i][0] || (lsc->lsc_coef_b.coef[i]) > DSP2_LSC_COEF_LIMIT[i][1]) {
            return false;
        }
    }

    return true;
}

static int DSP2_Calc_Clamp_Gain(int black_level)
{
    return DIV_ROUND(4095 * 4096, (4095 - black_level));
}

/*@} end of group DSP2_Private_Functions */

/** @defgroup  DSP2_Public_Functions
 *  @{
 */

void DSP2_Init(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(DSP2_BASE, DSP2_MIDDLE_AE_COEFF);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MIDDLE_AE_YSUM_COEFF_R_PRE, 77);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MIDDLE_AE_YSUM_COEFF_G_PRE, 150);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MIDDLE_AE_YSUM_COEFF_B_PRE, 29);
    BL_WR_REG(DSP2_BASE, DSP2_MIDDLE_AE_COEFF, tmpVal);

    tmpVal = BL_RD_REG(DSP2_BASE, DSP2_BLBACK_DNR_B);
    /* yuv output 16bit mode */
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_BLBACK_OUT_FORMAT_W, 1);
    /* YUYV order */
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_BLBACK_CBCR_SELECT_W, 1);

    BL_WR_REG(DSP2_BASE, DSP2_BLBACK_DNR_B, tmpVal);
    tmpVal = BL_RD_REG(DSP2_BASE, DSP2_MIDDLE_AWB_SETTING);
    tmpVal = BL_SET_REG_BIT(tmpVal, DSP2_MIDDLE_BL_AWB_GAIN_SEL_W);
    tmpVal = BL_SET_REG_BIT(tmpVal, DSP2_MIDDLE_BL_DIGITAL_GAIN_SEL_W);

    BL_WR_REG(DSP2_BASE, DSP2_MIDDLE_AWB_SETTING, tmpVal);
}

void DSP2_Set_TG_Cfg(const DSP2_TG_Cfg_Type *cfg)
{
    dsp2_tg_reg_t *dsp2_tg_reg = (dsp2_tg_reg_t *)DSP2_BASE;

    uint16_t act_start_pixel = 0;
    uint16_t act_pixel_width = 0;
    uint16_t act_start_line = 0;
    uint16_t act_line_height = 0;

    uint16_t out_pixel_width = 0;
    uint16_t out_line_height = 0;

    uint16_t out_start_pixel = 0;
    uint16_t out_start_line = 0;

    /* TODO: crop the best window */
    if (DSP2_SYNC_MODE_INPUT_VBLANK_NO_TOGGLE == cfg->sync_mode_value) {
        act_start_pixel = 0; /* hcount reset in rising edge, so H blanking is put after valid line */
        act_pixel_width = cfg->active_width;
        act_start_line = 0;
        act_line_height = cfg->active_height;
    } else {
        act_start_pixel = cfg->total_width - cfg->active_width;
        act_pixel_width = cfg->active_width;
        act_start_line = cfg->total_height - cfg->active_height;
        act_line_height = cfg->active_height;
    }

    out_pixel_width = cfg->out_width;
    out_line_height = cfg->out_height;

    out_start_pixel = (act_pixel_width - out_pixel_width) / 2;
    out_start_line = (act_line_height - out_line_height) / 2;

    /* further reduce frame latency by enabling act_vsync reset mode on vsync edge */
    dsp2_tg_reg->dvp_mode.BF.reg_act_vsync_rst_en_w = 1;

    /* set sync mode */
    dsp2_tg_reg->dvp_mode.BF.sync_mode_w = cfg->sync_mode_value;
    dsp2_tg_reg->dvp_mode.BF.hsync_in_inv_w = DSP2_HSYNC_INVERT_NORMAL;
    /* dvp_tsrc would do vsync invert so vsync pulse is always active low */
    dsp2_tg_reg->dvp_mode.BF.vsync_in_inv_w = DSP2_VSYNC_INVERT_NORMAL;
    dsp2_tg_reg->dvp_mode.BF.fhblk_line_on_w = DSP2_FHBLK_LINE_OFF;

    /* note: if vsync invert, vcnt reset mode set 0, means falling
        else if vsync not invert,  vcont reset mode set 1, also means falling
        this value will not open to user now.
    */
    if (DSP2_SYNC_MODE_INPUT_VBLANK_NO_TOGGLE == cfg->sync_mode_value) {
        /* hcnt reset in rising edge, so H blanking is put after valid line
            vcnt reset mode must be 0, to make sure vcnt is reset to 4095 instead of 0. */
        dsp2_tg_reg->dvp_mode.BF.hcnt_rst_mode_w = DSP2_HCNT_RST_RISING;
        dsp2_tg_reg->dvp_mode.BF.vcnt_rst_mode_w = DSP2_VCNT_RST_RISING;
    } else {
        dsp2_tg_reg->dvp_mode.BF.hcnt_rst_mode_w = DSP2_HCNT_RST_FALLING;
        dsp2_tg_reg->dvp_mode.BF.vcnt_rst_mode_w = DSP2_HCNT_RST_FALLING;
    }

    /* set total pixels and total lines */
    dsp2_tg_reg->total_pixels.BF.total_hpixels_w =
        DSP2_Calc_Total_Width(cfg);

    dsp2_tg_reg->total_pixels.BF.total_vlines_w = cfg->total_height;
    ;

