RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_dsp2.c
    /* act start pixel, act pixel width */
    dsp2_tg_reg->act_pixels_1.BF.act_start_pixel_w = act_start_pixel;
    dsp2_tg_reg->act_pixels_1.BF.act_pixel_width_w = act_pixel_width;

    /* act start line, act line height */
    dsp2_tg_reg->act_pixels_2.BF.act_start_line_w = act_start_line;
    dsp2_tg_reg->act_pixels_2.BF.act_line_height_w = act_line_height;

    /* out start pixel, out pixel width */
    dsp2_tg_reg->fact_pixels_1.BF.fact_start_pixel_w = out_start_pixel;
    dsp2_tg_reg->fact_pixels_1.BF.fact_pixel_width_w = out_pixel_width;

    /* out start line, out line height*/
    dsp2_tg_reg->fact_pixels_2.BF.fact_start_line_w = out_start_line;

    dsp2_tg_reg->fact_pixels_2.BF.fact_line_height_w = out_line_height;
}

int DSP2_Get_Output_Window(BL_Img_Size_T *out_win)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(DSP2_BASE, DSP2_TG_FACT_PIXELS_1);
    out_win->width = BL_GET_REG_BITS_VAL(tmpVal, DSP2_TG_FACT_PIXEL_WIDTH_W);
    tmpVal = BL_RD_REG(DSP2_BASE, DSP2_TG_FACT_PIXELS_2);
    out_win->height = BL_GET_REG_BITS_VAL(tmpVal, DSP2_TG_FACT_LINE_HEIGHT_W);

    return 0;
}

void DSP2_Set_Bayer_Pattern(const BAYER_PATTERN_E *pattern)
{
    dsp2_front_reg_t *dsp2_front_reg = (dsp2_front_reg_t *)DSP2_BASE;

    dsp2_front_reg->pattern_mode.BF.pattern_mode_w = 0;

    /* fix issue: bayer pattern highly sensitive to total width setting */
    dsp2_front_reg->pattern_mode.BF.reg_bl_lpid_sel_w = 1;

    if (*pattern == BAYER_PATTERN_BG) {
        /* lid invert depends on the total height */
        dsp2_front_reg->pattern_mode.BF.pid_inv_rgb_pre = 1;
        dsp2_front_reg->pattern_mode.BF.lid_inv_rgb_pre = 1;
    } else if (*pattern == BAYER_PATTERN_RG) {
        dsp2_front_reg->pattern_mode.BF.pid_inv_rgb_pre = 0;
        dsp2_front_reg->pattern_mode.BF.lid_inv_rgb_pre = 0;
    } else if (*pattern == BAYER_PATTERN_GR) {
        dsp2_front_reg->pattern_mode.BF.pid_inv_rgb_pre = 1;
        dsp2_front_reg->pattern_mode.BF.lid_inv_rgb_pre = 0;
    } else if (*pattern == BAYER_PATTERN_GB) {
        dsp2_front_reg->pattern_mode.BF.pid_inv_rgb_pre = 0;
        dsp2_front_reg->pattern_mode.BF.lid_inv_rgb_pre = 1;
    } else {
#if DSP2_PRINT_LOG
        MSG("Error bayer pattern!\n");
#endif
        return;
    }

    /* hack for CISTA sensor */
    //dsp2_front_reg->pattern_mode.BF.pid_inv_rgb_pre = 1;
    //dsp2_front_reg->pattern_mode.BF.lid_inv_rgb_pre = 0;
}

void DSP2_Set_AE_State(BL_Fun_Type state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(DSP2_BASE, DSP2_MIDDLE_AE_GRID_SIZE);

    if (ENABLE == state) {
        tmpVal = BL_SET_REG_BIT(tmpVal, DSP2_MIDDLE_NEW_AE_STA_ENABLE_W);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, DSP2_MIDDLE_NEW_AE_STA_ENABLE_W);
    }

    BL_WR_REG(DSP2_BASE, DSP2_MIDDLE_AE_GRID_SIZE, tmpVal);
}

void DSP2_Set_AE_Stats_Conf(const dsp2_ae_stats_conf_t *ae_stats_conf)
{
    uint32_t tmpVal;

    CHECK_PARAM_MAX(ae_stats_conf->roi_start_x, DSP2_AE_ROI_START_X_RANGE_MAX);
    CHECK_PARAM_MAX(ae_stats_conf->roi_start_y, DSP2_AE_ROI_START_Y_RANGE_MAX);
    CHECK_PARAM_RANGE(ae_stats_conf->roi_width,
                      DSP2_AE_ROI_WIDTH_RANGE_MIN, DSP2_AE_ROI_WIDTH_RANGE_MAX);
    CHECK_PARAM_RANGE(ae_stats_conf->roi_height,
                      DSP2_AE_ROI_HEIGHT_RANGE_MIN, DSP2_AE_ROI_HEIGHT_RANGE_MAX);
    CHECK_PARAM_MIN(ae_stats_conf->grid_width, DSP2_AE_GRID_WIDTH_RANGE_MIN);
    CHECK_PARAM_MIN(ae_stats_conf->grid_height, DSP2_AE_GRID_HEIGHT_RANGE_MIN);
    CHECK_PARAM_RANGE(ae_stats_conf->grid_num_x,
                      DSP2_AE_GRID_NUM_X_RANGE_MIN, DSP2_AE_GRID_NUM_X_RANGE_MAX);
    CHECK_PARAM_RANGE(ae_stats_conf->grid_num_y,
                      DSP2_AE_GRID_NUM_Y_RANGE_MIN, DSP2_AE_GRID_NUM_Y_RANGE_MAX);

    /* special check */

    /* AE ROI must be in the active image region */
    if ((ae_stats_conf->roi_start_x + ae_stats_conf->roi_width > ae_stats_conf->img_width) ||
        (ae_stats_conf->roi_start_y + ae_stats_conf->roi_height > ae_stats_conf->img_height)) {
#if DSP2_PRINT_LOG
        MSG("AE ROI must be in the active image region!\r\n");
#endif
    }

    /* grid width/height must be even number */
    if ((ae_stats_conf->grid_width & 0x1) & (ae_stats_conf->grid_height & 0x1)) {
#if DSP2_PRINT_LOG
        MSG("Grid width/height must be even number!\r\n");
#endif
    }

    tmpVal = BL_RD_REG(DSP2_BASE, DSP2_MIDDLE_AE_ROI_X);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MIDDLE_AE_ROI_START_X_PRE, ae_stats_conf->roi_start_x);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MIDDLE_AE_ROI_WIDTH_PRE, ae_stats_conf->roi_width);
    BL_WR_REG(DSP2_BASE, DSP2_MIDDLE_AE_ROI_X, tmpVal);

    tmpVal = BL_RD_REG(DSP2_BASE, DSP2_MIDDLE_AE_ROI_Y);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MIDDLE_AE_ROI_START_Y_PRE, ae_stats_conf->roi_start_y);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MIDDLE_AE_ROI_HEIGHT_PRE, ae_stats_conf->roi_height);
    BL_WR_REG(DSP2_BASE, DSP2_MIDDLE_AE_ROI_Y, tmpVal);

    tmpVal = BL_RD_REG(DSP2_BASE, DSP2_MIDDLE_AE_IMAGE_SIZE);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MIDDLE_AE_IMAGE_WIDTH_PRE, ae_stats_conf->img_width);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MIDDLE_AE_IMAGE_HEIGHT_PRE, ae_stats_conf->img_height);
    BL_WR_REG(DSP2_BASE, DSP2_MIDDLE_AE_IMAGE_SIZE, tmpVal);

    tmpVal = BL_RD_REG(DSP2_BASE, DSP2_MIDDLE_AE_GRID_SIZE);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MIDDLE_AE_GRID_WIDTH_PRE, ae_stats_conf->grid_width);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MIDDLE_AE_GRID_HEIGHT_PRE, ae_stats_conf->grid_height);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MIDDLE_AE_GRID_X_MAX_PRE, ae_stats_conf->grid_num_x);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MIDDLE_AE_GRID_Y_MAX_PRE, ae_stats_conf->grid_num_y);
    tmpVal = BL_SET_REG_BIT(tmpVal, DSP2_MIDDLE_NEW_AE_STA_ENABLE_W);
    /* AE occupies 2 bank of memory*/
    tmpVal = BL_SET_REG_BIT(tmpVal, DSP2_MIDDLE_AE_SWITCH_BANK_EN_PRE);
    BL_WR_REG(DSP2_BASE, DSP2_MIDDLE_AE_GRID_SIZE, tmpVal);
}

void DSP2_Get_AE_Stats_Conf(dsp2_ae_stats_conf_t *ae_stats_conf)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(DSP2_BASE, DSP2_MIDDLE_AE_ROI_X);
    ae_stats_conf->roi_start_x = BL_GET_REG_BITS_VAL(tmpVal, DSP2_MIDDLE_AE_ROI_START_X_PRE);
    ae_stats_conf->roi_width = BL_GET_REG_BITS_VAL(tmpVal, DSP2_MIDDLE_AE_ROI_WIDTH_PRE);

