RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_dsp2.c
void DSP2_Get_3D_NR(int *value)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(DSP2_BASE, DSP2_BLBACK_DNR_A);
    *value = BL_GET_REG_BITS_VAL(tmpVal, DSP2_BLBACK_FILT_STRENGTH_3D_PRE);
}

void DSP2_Set_EE_State(BL_Fun_Type state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(DSP2_BASE, DSP2_BLBACK_BLEE_0);

    if (ENABLE == state) {
        tmpVal = BL_SET_REG_BIT(tmpVal, DSP2_BLBACK_EE_EB_PRE);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, DSP2_BLBACK_EE_EB_PRE);
    }

    BL_WR_REG(DSP2_BASE, DSP2_BLBACK_BLEE_0, tmpVal);
}

void DSP2_Enable_EE(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(DSP2_BASE, DSP2_BLBACK_BLEE_0);
    tmpVal = BL_SET_REG_BIT(tmpVal, DSP2_BLBACK_EE_EB_PRE);
    BL_WR_REG(DSP2_BASE, DSP2_BLBACK_BLEE_0, tmpVal);
}

void DSP2_Disable_EE(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(DSP2_BASE, DSP2_BLBACK_BLEE_0);
    tmpVal = BL_CLR_REG_BIT(tmpVal, DSP2_BLBACK_EE_EB_PRE);
    BL_WR_REG(DSP2_BASE, DSP2_BLBACK_BLEE_0, tmpVal);
}

void DSP2_EnableEEOverShoot(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(DSP2_BASE, DSP2_BLBACK_BLEE_0);
    tmpVal = BL_SET_REG_BIT(tmpVal, DSP2_BLBACK_OVRSHT_EB_PRE);
    BL_WR_REG(DSP2_BASE, DSP2_BLBACK_BLEE_0, tmpVal);
}

void DSP2_DisableEEOverShoot(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(DSP2_BASE, DSP2_BLBACK_BLEE_0);
    tmpVal = BL_CLR_REG_BIT(tmpVal, DSP2_BLBACK_OVRSHT_EB_PRE);
    BL_WR_REG(DSP2_BASE, DSP2_BLBACK_BLEE_0, tmpVal);
}

void DSP2_Set_EE_Thresh(const DSP2_EE_Thresh_Type *threshCfg)
{
    uint32_t tmpVal;

    CHECK_PARAM_MAX(threshCfg->dirShpnessThresh, DSP2_EE_DIR_SHPNSS_THRESH_MAX);
    CHECK_PARAM_MAX(threshCfg->noDirShpnessThresh, DSP2_EE_NO_DIR_SHPNSS_THRESH_MAX);
    CHECK_PARAM_RANGE(threshCfg->textureThresh, (threshCfg->flatThresh + 1), DSP2_EE_TEXTURE_REGION_THRESH_MAX);
    CHECK_PARAM_MIN(threshCfg->edgeThresh, (threshCfg->textureThresh + 1));

    tmpVal = BL_RD_REG(DSP2_BASE, DSP2_BLBACK_BLEE_0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_BLBACK_TXT_THR_PRE, threshCfg->textureThresh);
    BL_WR_REG(DSP2_BASE, DSP2_BLBACK_BLEE_0, tmpVal);

    tmpVal = BL_RD_REG(DSP2_BASE, DSP2_BLBACK_BLEE_1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_BLBACK_THRESH1_PRE, threshCfg->dirShpnessThresh);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_BLBACK_THRESH2_PRE, threshCfg->noDirShpnessThresh);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_BLBACK_FLAT_THR_PRE, threshCfg->flatThresh);
    BL_WR_REG(DSP2_BASE, DSP2_BLBACK_BLEE_1, tmpVal);

    tmpVal = BL_RD_REG(DSP2_BASE, DSP2_BLBACK_BLEE_3);
    ;
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_BLBACK_EDGE_THR_PRE, threshCfg->edgeThresh);
    BL_WR_REG(DSP2_BASE, DSP2_BLBACK_BLEE_3, tmpVal);
}

void DSP2_Get_EE_Thresh(DSP2_EE_Thresh_Type *threshCfg)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(DSP2_BASE, DSP2_BLBACK_BLEE_0);
    threshCfg->textureThresh = BL_GET_REG_BITS_VAL(tmpVal, DSP2_BLBACK_TXT_THR_PRE);

    tmpVal = BL_RD_REG(DSP2_BASE, DSP2_BLBACK_BLEE_1);
    threshCfg->dirShpnessThresh = BL_GET_REG_BITS_VAL(tmpVal, DSP2_BLBACK_THRESH1_PRE);
    threshCfg->noDirShpnessThresh = BL_GET_REG_BITS_VAL(tmpVal, DSP2_BLBACK_THRESH2_PRE);
    threshCfg->flatThresh = BL_GET_REG_BITS_VAL(tmpVal, DSP2_BLBACK_FLAT_THR_PRE);

    tmpVal = BL_RD_REG(DSP2_BASE, DSP2_BLBACK_BLEE_3);
    threshCfg->edgeThresh = BL_GET_REG_BITS_VAL(tmpVal, DSP2_BLBACK_EDGE_THR_PRE);
}

void DSP2_Set_EE_Strength(const DSP2_EE_Str_Type *strCfg)
{
    uint32_t tmpVal;

    CHECK_PARAM_MAX(strCfg->posEdgeOvrshtStr, DSP2_EE_STRENGTH_MAX);
    CHECK_PARAM_MAX(strCfg->negEdgeOvrshtStr, DSP2_EE_STRENGTH_MAX);
    CHECK_PARAM_MAX(strCfg->posEdgeStr, DSP2_EE_STRENGTH_MAX);
    CHECK_PARAM_MAX(strCfg->negEdgeStr, DSP2_EE_STRENGTH_MAX);

    tmpVal = BL_RD_REG(DSP2_BASE, DSP2_BLBACK_BLEE_2);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_BLBACK_OVRSHT_POS_PRE, strCfg->posEdgeOvrshtStr);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_BLBACK_OVRSHT_NEG_PRE, strCfg->negEdgeOvrshtStr);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_BLBACK_POSEE_STR_PRE, strCfg->posEdgeStr);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_BLBACK_NEGEE_STR_PRE, strCfg->negEdgeStr);
    BL_WR_REG(DSP2_BASE, DSP2_BLBACK_BLEE_2, tmpVal);

    tmpVal = BL_RD_REG(DSP2_BASE, DSP2_BLBACK_BLEE_3);
    ;
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_BLBACK_NR_STR_PRE, strCfg->nrStr);
    BL_WR_REG(DSP2_BASE, DSP2_BLBACK_BLEE_3, tmpVal);
}

void DSP2_Get_EE_Strength(DSP2_EE_Str_Type *strCfg)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(DSP2_BASE, DSP2_BLBACK_BLEE_2);
    strCfg->posEdgeOvrshtStr = BL_GET_REG_BITS_VAL(tmpVal, DSP2_BLBACK_OVRSHT_POS_PRE);
    strCfg->negEdgeOvrshtStr = BL_GET_REG_BITS_VAL(tmpVal, DSP2_BLBACK_OVRSHT_NEG_PRE);
    strCfg->posEdgeStr = BL_GET_REG_BITS_VAL(tmpVal, DSP2_BLBACK_POSEE_STR_PRE);
    strCfg->negEdgeStr = BL_GET_REG_BITS_VAL(tmpVal, DSP2_BLBACK_NEGEE_STR_PRE);

    tmpVal = BL_RD_REG(DSP2_BASE, DSP2_BLBACK_BLEE_3);
    ;
    strCfg->nrStr = BL_GET_REG_BITS_VAL(tmpVal, DSP2_BLBACK_NR_STR_PRE);
}

void DSP2_Set_EE_LumaWeight(const DSP2_EE_Luma_Weight_Type *lumaWgtCfg)
{
    int i;
    uint32_t tmpVal;
    uint32_t tmpAddr = DSP2_BASE + DSP2_BLBACK_BLEE_4_OFFSET;

    for (i = 0; i < DSP2_EE_LUMA_WEIGHT_NUM; i += 2, tmpAddr += 4) {
        CHECK_PARAM_MAX(lumaWgtCfg->lumaWgtTbl[i], DSP2_EE_LUMA_WEIGHT_MAX);
        CHECK_PARAM_MAX(lumaWgtCfg->lumaWgtTbl[i + 1], DSP2_EE_LUMA_WEIGHT_MAX);
        tmpVal = BL_RD_WORD(tmpAddr);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_BLBACK_LUMA_WGT0_PRE, lumaWgtCfg->lumaWgtTbl[i]);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_BLBACK_LUMA_WGT1_PRE, lumaWgtCfg->lumaWgtTbl[i + 1]);
        BL_WR_WORD(tmpAddr, tmpVal);
    }
}

void DSP2_Get_EE_LumaWeight(DSP2_EE_Luma_Weight_Type *lumaWgtCfg)
{
    int i;
    uint32_t tmpVal;
    uint32_t tmpAddr = DSP2_BASE + DSP2_BLBACK_BLEE_4_OFFSET;

    for (i = 0; i < DSP2_EE_LUMA_WEIGHT_NUM; i += 2, tmpAddr += 4) {
        tmpVal = BL_RD_WORD(tmpAddr);
        lumaWgtCfg->lumaWgtTbl[i] = BL_GET_REG_BITS_VAL(tmpVal, DSP2_BLBACK_LUMA_WGT0_PRE);
        lumaWgtCfg->lumaWgtTbl[i + 1] = BL_GET_REG_BITS_VAL(tmpVal, DSP2_BLBACK_LUMA_WGT1_PRE);
    }
}

void DSP2_Set_ChromaSuppress_State(BL_Fun_Type state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(DSP2_BASE, DSP2_BLBACK_CS2);

